[
    {
        "id":0,
        "work":"FULLSTACK DEVELOPER",
        "company":"บริษัท เวล คอนเน็คเต็ท จํากัด",
        "start":"มกราคม 2562",
        "end":"เมษายน 2567",
        "content":[
                "พัฒนาระบบงาน Web Application ด้วย HTML , Javascript ,  PHP Codeigniter ,  ReactJS ,  GatsbyJS , NodeJS , NextJS , Wordpress , PHP",
                "พัฒนาเว็บไชต์ React ด้วย ทรัพยากร React-router-dom , useState , useEffect , useRef , useContext , Datacontext , Swiper ",
                "ปรับปรุง เว็บไชต์เดิมใน บริษัทให้ เป็น React",
                "ออกแบบ Mockup Frontend เพื่อ ประกอบให้ลูกค้าตัดสินใจ",
                "ออกแบบและสร้างอินเทอร์เฟซผู้ใช้(UI) ด้วย  Bootstrap , React-Bootstrap Material UI(MUI) , Ant Design , jQuery , CSS3  รองรับ  Responsive Mobile",
                "ร้องขอข้อมูล API ด้วย Axios , Fetch , Ajax ,  Promise.all",
                "เก็บข้อมูลส่วนงาน Frontend  ด้วย  Localstorage อาทิ ระบบตระกร้าสินค้า และ Token ต่างๆ",
                "พัฒนาระบบ Backend ด้วย NodeJS( Express  , dotenv , bcrypt ,JWT , socket.io, uuid , cors , multer) , PHP",
                "ปรับปรุง Web Service API ด้วย NodeJS , PHP",
                "ทดสอบ API ด้วย  Postman",
                "สร้างเว็บไชต์ ด้วยเทคโนโลยี Amp เพื่อเพิ่ม PageSpeed Insight สำหรับ Google",
                "ปรับแต่ง Website ให้เหมาะสำหรับ SEO",
                "พัฒนา Short Code และ Hook เพื่อเพิ่มความสามารถ สำหรับ Wordpress",
                "สร้าง Line Messaging API แบบโต้ตอบอัตโนมัติ เพื่อ ปฏิสัมพันธ์กับลูกค้า และ Flex Message เพื่อเพิ่มยอดขายของผลิตภัณฑ์ , เชื่อมต่อไปยังฐานข้อมูล สำหรับสมาชิก , เชื่อมต่อไปยัง Service ต่างๆ ที่ลูกค้าร้องขอ , ออกแบบ Rich Menu",
                "พัฒนา ENDPOINT สำหรับ สำรองข้อมูล ก่อน INSERT เข้า ฐานข้อมูล และ ร้องขอข้อมูลไปยัง SERVICE ต่างๆ ภายในบริษัท",
                "พัฒนา DashBoard สำหรับ โปรเจ๊คต่างๆ เพื่อ บริหารจัดการ ตาม  Role(user, Editor , Admin)",
                "พัฒนา ระบบ ส่ง Email Smtp เพื่อ ส่ง โปรโมชั่น เพิ่มเติม",
                "วิเคราะห์ข้อมูล เพื่อทำ Model",
                "ออกแบบฐานข้อมูล ด้วย MYSQL , SQLSERVER , MSSQL",
                "ออกแบบ ER Diagram เพื่อเพิ่มความเข้าใจในทีม",
                "Normalization ฐานข้อมูล ตามลำดับความสำคัญ",
                "สร้าง View สำหรับ ฐานข้อมูล Mysql เพื่อสะดวกต่อการเรียกใช้",
                "ออกแบบ ฐานข้อมูล NOSQL JSON FILE , MongoDB",
                "ทดสอบ แก้ไข หาข้อผิดพลาดของระบบ และ Clean Code ลดการทำงานซ้ำซ้อน เพื่อพัฒนาระบบให้ดียิ่งขึ้น",
                "พัฒนา NextJS เชื่อมต่อกับ 3rd Party ต่างๆ อาทิ Goalserve API(Livescore Realtime)",
                "ใช้การเข้ารหัสด้วย AES-256-CBC ส่วนงาน server PHP",
                "เข้ารหัส API Genarate Aes key ก่อนส่งไปยังฝั่ง SERVER",
                "ใช้ JWT(Json web Token) เพื่อสร้าง ACCESS TOKEN ฝั่ง Server NodeJS",
                "พัฒนา Chatbot realtime ด้วย Socket.io",
                "สร้าง CronJob เพื่อสั้งงาน Service ต่างๆในบริษัท",
                "จัดการเว็บไชต์ส่วนอื่นๆด้วย Cpanel , Directadmin , Hostinger",
                "ออกแบบ Format ข้อมูลด้วย JSON",
                "ใช้ Github ในการ แชร์ Code" , 
                "ใช้ Docker File(docker compose) ในการ Deploy เว็บไชต์ไปยัง Server Digitalocean"
             ]
    },
    {
        "id":1,
        "work":"FULLSTACK DEVELOPER",
        "company":"บริษัท เทเลคอร์ป จํากัด",
        "start":"กุมภาพันธ์ 2560",
        "end":"ตุลาคม 2560",
        "content":[
                "ออกแบบระบบจัดการ สำหรับ คลีนิก , ออก รายงาน อัตโนมัติ (PHP Printer) , เช็คสต็อกสินค้าคงเหลือ , ระบบแคชเชียร์ และ ออกรายงาน(MPDF) อาทิเช่น OPDCARD ,  Visit Slip , เอกสารการจ่ายยา , ใบเสร็จรับเงิน",
                "พัฒนาเว็บไชต์ STEMI ส่วนงานโรงพยาบาล ราชวิถี สำหรับ ห้อง ปฎิบัติการ CathLab เพื่อให้ โรงพยาบาลในเครืองข่าย ขอใช้ห้อง กรณี ห้อง CathLab โรงพยาบาลไม่พอ พัฒนาด้วยเทคโนโลยี PHP socket, GoogleMap API ",
                "ออกแบบและ พัฒนาระบบจัดการ คิวโรงพยาบาล สำหรับเก็บข้อมูลหมอ และ คนไข้ ส่วนงานหลังบ้าน",
                "ออกแบบ (UI) ระบบคิว สำหรับ เรียกคิว ( HTML5, CSS3, JavaScript, jQuery , Bootstarp)",
                "พัฒนา Backend ด้วย C# และ PHP" , 
                "ออกแบบระบบฐานข้อมูลด้วย SQL SERVER",
                "พัฒนาระบบนำเข้าข้อมูล CSV และ EXPORT CSV",
                "เขียน Stored Procedure เพื่อประหยัด ทรัพยากร SQL",
                "ออกแบบรายงานด้วย Crystal report, Jasper report",
                "เขียนคู่มือการใช้โปรแกรม และ งานเอกสารเกี่ยวกับ ระบบ"
              
            ]
    },
    {
        "id":2,
        "work":"Junior Developer",
        "company":"ซีเทคกรุ๊ป คอนเซาท์เอ็นจิเนียร์(บริษัท เซ้าท์อี๊สท์เอเซียเทคโนโลยี่จํากัด)",
        "start":"พฤษภาคม 2558",
        "end":"มกราคม 2560",
        "content":[
                "วิเคราะห์ความต้องการของลูกค้า และ พัฒนาระบบตามความต้องการ",
                "วิเคราะห์ข้อมูลทางวิศวกรรมที่ได้จากแผนกต่างในบริษัท จัดทำ API ให้ง่ายต่อการร้องขอข้อมูล",
                "พัฒนาโปรแกรมด้วย C# , PHP, HTML, JSON with Javascript And JQuery,Ajax, Bootstrap ,Jqgrid, Wrap Bootstarp , Google Map api , MPDF , Ckeditor etc.",
                "ออกแบบระบบภายในบริษัทด้วย C# Window Forms Application.",
                "พัฒนาระบบนำเข้าข้อมูล Shapefile ส่วนงาน GIS (แผนที่)",
                "พัฒนาระบบ แปลงข้อมูล Shapefile ให้อยู่ในรูปแบบ JSON",
                "พัฒนาระบบคำนวณพลังงานของแผงโซลาร์เซลล์เก็บค่าแต่ละชั่วโมง วัน สัปดาห์ เดือน ปี เพื่อหาช่วงเวลาที่ดีที่สุด ที่ แผงโซลาร์เซลล์เก็บค่าพลังงานได้มากที่สุด แสดงรายงาน รูปแบบ กราฟ แสดงทุก วินาที เรียกข้อมูลจาก API ภายนอก",
                "แปลงข้อมูล ตำแหน่ง ให้อยู่ในรูปแบบ  Geometry(latitude and longitude) เพื่อใช้งาน Google MAP API อาทิ  Polylines , Polygon , Point",
                "พัฒนาระบบหลังบ้าน ด้วย Web Service PHP",
                "ออกแบบระบบฐานข้อมูลด้วย Microsoft Access ,Mysql , Sqlite. , Mysql",
                "พัฒนา API ข้อมูลแผนที่ด้วย JSON FILE และ XML",
                "ออกแบบงานเอกสาร PHP Excel สำหรับ ประเมิน KPI พนักงาน",
                "ทบทวนความสามารถของ Workflow และข้อจำกัด ในการออกแบบโปรแกรมเพื่อปรับปรุงประสิทธิภาพ",
                "ประเมินการเขียนโปรแกรมเพื่อให้มีประสิทธิภาพและแก้จุดบกพร่อง"
            ]
    },
    {
        "id":3,
        "work":"Junior Programmer",
        "company":"บริษัท อินชัวร์เอ็กซ์เพิร์ธ โบรคเกอร์จํากัด",
        "start":"กันยายน 2557",
        "end":"พฤษภาคม 2558",
        "content":[
                "สร้างเว็บไชต์ เช็คราคาประกันภัยรถยนต์ออนไลน์ และ อีคอมเมิร์ซ(PHP)",
                "ออกแบบ ฐานข้อมูลด้วย MYSQL",
                "วิเคราะห์ข้อมูลด้านประกันภัยรถยนต์ ที่เหมาะสำหรับในการ QUERY ราคา",
                "แปลงข้อมูลประกันภัยแต่ละบริษัทประกันที่ส่งให้ โบรคเกอร์ อยู่ใน รูปแบบกลางเพื่อง่ายต่อการค้นหา และ นำเข้าข้อมูลสู่ ฐานข้อมูล",
                "ออกแบบระบบจัดการ ราคาประกันภัย และ ส่วนงานต่างๆให้สามารถปรับปรุงแก้ไขได้",
                "ออกแบบเว็บไซต์ให้เหมาะสมกับธุรกิจของลูกค้า",
                "วิเคราะห์คำหลักสำหรับ SEO (Keyword Planner)",
                "วิเคราะห์เว็บไซต์ให้อัตราตีกลับน้อยที่สุด",
                "ออกแบบแบนเนอร์ให้เหมาะสมสำหรับโฆษณา Google Adword && Facebook Ads"

            ]
    },
    {
        "id":4,
        "work":"PROGRAMMER(Trainee)",
        "company":"บริษัท เวล คอนเน็คเต็ท จํากัด",
        "start":"พฤษภาคม 2554",
        "end":"กันยายน 2554",
        "content":[
                "สร้างเว็บไชต์ และปรับปรุง เว็บคณะ วิศวกรรมคอมพิวเตอร์",
                "ลงทะเบียน อินเทอร์เน็ต ให้นิสิตใหม่ มหาวิทยาลัยเกษตรศาสตร์",
                "แก้ปัญหา ด้านคอมพิวเตอร์ให้ นิสิตใหม่"
            ]
    }
    
 ]